Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: The facilities needed are determined according to the content of each section of the provisions and the general principle laid down in Section 92.
sv: Vilka som behövs avgörs med ledning av bestämmelserna under respektive avsnitt i föreskrifterna och den övergripande bestämmelsen i 90 §.

source: The school playground counts as a social area for pupils, but can also be the workplace for pupils and personnel.
sv: Skolgården räknas som pausutrymme för elever men kan också utgöra arbetsplats för elever och personal.

source: A personnel facility may consist either of a complete room or, in certain cases, of part of a room, e.g. a screened-off area.
sv: Ett personalutrymme kan utgöras antingen av ett helt rum eller i vissa fall en del, t.ex. en avskärmning av ett rum.

source: For work at a non- permanent worksite, the personnel facility may also be accommodated, for example, in a cabin, a specially prepared motor vehicle or, as a temporary expedient, in an existing building.
sv: Vid arbete utanför ett fast driftsställe kan personalutrymmet också inrymmas i t.ex. en personalbod, en särskilt iordningställd bil eller tillfälligt i en befintlig byggnad.

source: See also "Glossary" on pages 98-102.
sv: Se även ”Ordförklaringar”.

source: Their work environment condition is extensively affected by the way in which buildings and structures are positioned on the site.
sv: Deras arbetsmiljö påverkas i stor utsträckning av hur byggnader och anläggningar är placerade på tomten.

source: There are also other groups whose work environment conditions can be affected.
sv: Det finns också andra grupper vars arbetsmiljö kan påverkas.

source: These include, for example, refuse collection workers, newspaper delivery personnel, special transport assistance personnel, ambulance personnel, lorry drivers, delivery vehicle drivers and security personnel.
sv: Hit hör t.ex. renhållningsarbetare, tidningsbud, färdtjänstpersonal, ambulansperso- nal, lastbilschaufförer, varubud och bevakningspersonal.

source: It is primarily the employers of these groups who are responsible for their work environment conditions, but a certain responsibility also devolves on the
sv: Det är i första hand dessa gruppers arbetsgivare som har ansvaret för deras arbetsmiljö.

source: person controlling the worksite to which they come, though only in cases where the worksite also includes the developed land.
sv: Ett visst ansvar finns också hos den som råder över det arbetsställe dit de kommer, men bara i de fall då arbetsstället omfattar även tomtmarken.

source: In many jobs the risk of musculoskeletal injuries will be reduced if ground conditions and space permit the use of a barrow or tractor, e.g. for snow clearance or sand-spreading.
sv: Risken för belastningsskador minskar i många arbeten om marken medger och det finns utrymme att använda kärra eller traktor för t.ex. snöröjning eller sandning.

source: It is important that the traffic route from a refuse storage area to the street should permit the use of a cart.
sv: Från avfallsutrymme till gata är det viktigt att transport-vägen möjliggör hantering med kärra.

source: Experience has shown that wood, plaster, cladding elements and glass require attention many times during the useful life of a building.
sv: Trä, puts, fasadelement och glas har erfarenhetsmässigt visat sig behöva åtgärdas många gånger under en byggnads brukstid.

source: Outdoor lighting and other devices positioned on a facade need to be accessible, e.g. for the replacement of bulbs.
sv: Ytterbelysning och andra anordningar som placeras på fasad behöver vara åtkomliga t.ex. för byte av lampor.

source: Space for a mobile crane, a hoist or scaffolding on the ground may be necessary in order, for example, for window cleaning to proceed as safely as possible in the absence of any other arrangement.
sv: Utrymme för kranbil, lift eller ställning på mark kan behövas för att t.ex. fönstertvätt ska kunna utföras på ett så säkert sätt som möjligt om annan anordning saknas.

source: It is appropriate for lampposts, ventilation ducts etc. to be positioned on hard standing, use of a grass mowing machine being impossible in the immediate vicinity of such objects.
sv: Det är lämpligt att lyktstolpar, ventilationsrör m.m. placeras på en hård- gjord yta eftersom gräsklippning med maskin inte kan ske närmast sådana föremål.

source: An asphalted or gravel surface next to the facade and flowerbeds accessible for weeding will reduce the risk of musculoskeletal injuries resulting from ground work.
sv: En hårdgjord eller grusad yta närmast fasaden och rabatter som är åtkomliga för rensning minskar risken för belastningsskador vid tomtarbe-

source: The selection and positioning of plants in consultation with an expert can among other things result in fewer injuries on hard standing and less hazardous plant and ground maintenance.
sv: Växtval och placering i samråd med en sakkunnig kan bl.a. medföra färre skador på hårdgjorda ytor och riskfriare växt- och markunderhåll.

source: The positioning and alignment of the building should, among other things, be decided with reference to the local climate (wind conditions etc.).
sv: Byggnadens placering och orientering bör bl.a. bestämmas med hänsyn till det lokala klimatet (vindförhållanden etc).

source: Consideration should also be paid to the exclusion of daylight from other buildings and terrain and to ambient noise.
sv: Dessutom bör dagsljusavskärm- ning från andra byggnader och terräng samt buller i omgivningen beaktas.

source: The suitable size and design will depend partly on
sv: Vad som är lämplig storlek och utformning beror bl.a. på

source: the nature and extent of the activity
sv: verksamhetens art och omfattning,

source: the number of workers and shifts
sv: antalet arbetstagare och skiftgång,

source: the age of the workers
sv: arbetstagarnas ålder,

source: ventilation systems
sv: ventilationssystem,

source: lighting systems
sv: belysningssystem,

source: furnishing and equipment
sv: inredning och utrustning,

source: handling of dangerous substances
sv: hantering av farliga ämnen,

source: noise-generating activity
sv: bullrande verksamhet,

source: material storage areas
sv: upplag av material,

source: transport operations and movement
sv: transporter och förflyttningar,

source: refuse disposal and cleaning
sv: renhållning och städning,

source: utility spaces
sv: driftutrymmen,

source: disabled access and utility
sv: underhållsarbeten, könsfördelning.

source: Suitably sized work premises will mean sufficient space for work tables and machinery, for the operation, supervision and maintenance, for storage of materials, for passage and transport and safety from pinching etc.
sv: Lämplig storlek för en arbetslokal ger tillräckligt utrymme för arbetsbord och maskiner, för betjäning, tillsyn och underhåll, för upplag av material, för passage och transporter samt för säkerhet mot klämning osv.

source: A clearance of 0.6 m is usually sufficient to prevent pinching, e.g. between a moving machine part and a wall, pillar or suchlike.
sv: Ett fritt utrymme om 0,6 m är i regel tillräckligt för passage och för att förebygga att någon klämmer sig t.ex. mellan en rörlig maskindel och vägg, pelare eller dylikt.

source: The design of the facilities also decides communication possibilities and the view commanded of premises and communications.
sv: Lokalernas utformning bestämmer också kommunikationsmöjligheter och överblick av lokaler och samband.

source: These possibilities are important for the human need of social participation and orientation.
sv: Dessa möjligheter är viktiga för att tillfredsställa människans behov av social gemenskap och orientering.

source: Sometimes there is also a need for separation, e.g. for private conversations with patients or with parents in a pre-school.
sv: Ibland finns även behov av avskildhet vid exempelvis enskilda samtal med patienter eller föräldrar i en förskola.

source: For good visual conditions at work, it is important for the workplace to be arranged in such a way that the field of vision is not obstructed by furnishing, equipment or other objects.
sv: För att synförhållandena i arbetet ska vara bra är det viktigt att arbetsplatsen är ordnad så att synfältet inte störs av inredning, utrustning och andra föremål.

source: It is especially important that the size and design of premises should be decided according to musculoskeletal requirements, so as to afford room for work postures and working movements which are not strenuous and which can be relieved and varied.
sv: Det är särskilt viktigt att lokalernas storlek och utformning tar hänsyn till belastningsergonomiska krav, så att det finns utrymme för arbetsställningar och arbetsrörelser som inte är påfrestande och som kan avlastas och varieras.

source: At the same time, it is essential that the physical activity included in a job should not be excessively limited.
sv: Samtidigt är det angeläget att den fysiska aktiviteten i ett arbete inte blir alltför inskränkt.

source: Carefully considered positioning and design of meeting points for discussion and intellectual activity, as well as social areas, can help to make people more mobile.
sv: En genomtänkt placering och utformning av mötesplatser för diskussion och tankearbete, liksom av pausutrymmen kan bidra till att vi rör oss mer.

source: Clear space is needed for the care of bedridden patients or the transfer of patients.
sv: Vid vård eller förflyttning av patienter, behövs ett fritt utrymme.

source: When mobility aids are used, free space for handling and manoeuvring the aid is also needed.
sv: Då hjälpmedel används behövs dessutom ett fritt utrymme för att hantera och manövrera hjälpmedlet.

source: Premises also need as a rule to be designed and proportioned for cleaning work, e.g. leaving adequate room for manoeuvre.
sv: Lokaler behöver normalt också vara utformade och dimensionerade för städarbete, bl.a. ge tillräckligt svängrum.

source: Suitable design for cleaning work normally means providing sufficient room for the use of a cleaning trolley.
sv: Lämplig utformning för städar- bete innebär normalt att städvagn kan användas.

source: Clear floor spaces facilitate cleaning.
sv: Fria golvytor underlättar rengöringen.

source: In sanitary accommodation, floor cleaning is made easier by the toilet and wash basin being mounted on the wall
sv: I hygienrum underlättas golvrengöringen genom att toalettstol och tvättställ görs väggmonterade.

source: Certain activities, e.g. in shops or caring institutions, entail special risks of threats or violence to personnel.
sv: I vissa verksamheter förekommer särskilda risker för hot eller våld mot personalen, t.ex. i butiker eller vårdinrättningar.

source: These risks can be reduced by suitable arrangement and design of premises.
sv: Risken kan minskas med lämplig disposition och utformning av lokalerna.

source: Examples of measures are doors and locking systems to exclude unauthorised persons, a floor plan providing a clear view of the premises, entrances and visitors, safe distances and escape routes, suitable routes for the transport of valuables and, at an exit, an outward view and lighting making it possible for the area surrounding the exit to be monitored from inside.
sv: Exempel på åtgärder är dörrar och låssystem som utestänger obehöriga, en planlösning som ger uppsikt över lokal, entréer och besökande, säkerhetsavstånd och reträttvä- gar, lämpliga vägar för värdetransporter samt vid utgången sådan utblick och belysning att området kring utgången kan kontrolleras inifrån.

source: In pre-schools, child security needs to be satisfactory both outdoors and indoors.
sv: I förskolor behöver barnsäkerheten vara tillfredsställande både utomhus och inomhus.

source: The risk of accidents involving children entail strains on the personnel.
sv: Olycksfallsrisken för barnen innebär påfrestningar för personalen.

source: For child safety in pre-schools and schools, see the National Board of Housing, Building and Planning's Building Regulations, BBR.
sv: För barnsäkerhet i förskola och skola, se Boverkets Byggregler, BBR.

source: Low ceiling height can make it difficult to arrange satisfactory ventilation and lighting and can adversely affect daylighting.
sv: Liten rumshöjd kan göra det svårt att ordna tillfredsställande ventilation och belysning och kan inverka ofördelaktigt på dagsljuset.

source: A low ceiling height, for example, in a goods reception department can cause employees to use incorrect work postures, resulting in musculoskeletal injuries.
sv: Liten rumshöjd i exempelvis varumottag kan leda till arbete i felaktiga arbetsställningar med belastningsskador som följd.

source: The volume of air needed per person is not specifically regulated but is decided by the occurrence of air contaminants coupled with current stipulations concerning adequate, draught-free ventilation.
sv: Vilken luftvolym som behövs per person regleras inte särskilt utan bestäms av förekommande luftföroreningar kopplat till gällande krav på tillräcklig och dragfri ventilation.

source: The height of a room is normally calculated from floor to ceiling and to the underside of girders, ventilation ducts etc., unless their effect on the height of the room can be accepted without inconvenience.
sv: Rumshöjden räknas normalt till undertak och till underkant av balkar, ventilationskanaler o.dyl., såvida inte deras inverkan på rumshöjden kan godtas utan olägenhet.

source: The ceiling height sufficient at a workplace or in a workroom will depend partly on the work machinery, lifting devices and other technical devices used in the undertaking.
sv: Vilken fri höjd som är tillräcklig på en arbetsplats eller i en arbetslokal beror bl.a. på vilka arbetsmaskiner, lyftanordningar och andra tekniska anordningar som används i verksamheten.

source: It is important to remember that supervision and maintenance also demand a certain ceiling height.
sv: Det är viktigt att beakta att även tillsyn och skötsel kräver viss fri höjd.

source: A ceiling height of 2.7 m is generally sufficient for work premises.
sv: För arbetslokaler är i allmänhet en rumshöjd av 2,7 m tillräcklig.

source: On premises where only a small number of persons are employed, a ceiling height of 2.4 m can often suffice.
sv: I lokaler där endast ett mindre antal personer arbetar kan ofta en rumshöjd av 2,4 m räcka.

source: A lower ceiling height may sometimes be sufficient in small parts of the premises, though generally not less than 2.1 m in a part of the premises where work is done and standing height is needed.
sv: En lägre rumshöjd kan ibland vara tillräcklig i mindre delar av lokalen, dock i allmänhet inte mindre än 2,1 m för sådan del där arbete utförs och ståhöjd erfordras.

source: Similarly, a lower ceiling height may sometimes be sufficient in spaces where people only work occasionally, e.g. machine rooms, small coolers and freezers, installation spaces, refuse storage spaces, culverts, communication spaces, control cabs and suchlike, though generally not less than 2.1 m.
sv: På samma sätt kan en mindre rumshöjd ibland vara tillräcklig i utrymmen där personer inte arbetar mer än tillfälligt, t.ex. maskinrum, små kyl- och frysrum, installationsutrymmen, avfallsutrymmen, kulvertar, kommu- nikationsutrymmen, manöverhytter och liknande, dock i allmänhet inte mindre än 2,1 m.

source: It is inappropriate for staircases to have less than 2.0 m ceiling height.
sv: Det är olämpligt med mindre fri höjd än 2,0 m i trappor.

source: It is important that spaces for utilities and ducts in foundations and attics should afford sufficient space for work and movement and for both installation and subsequent work.
sv: Det är viktigt att utrymmen för ledningar och kanaler i grund och på vind ger tillräckligt utrymme för både arbete och förflyttning och för både installation och senare arbeten.

source: The basic principle should be for the working space to be not less than 0.6 x 0.9 x 2.1 m in order for work to be possible in a reasonably acceptable manner.
sv: Utgångspunkten bör vara att arbetsutrymmet inte är mindre än 0,6x0,9x2,1 m för att arbetet ska kunna utföras på ett någorlunda godtagbart sätt.

source: Handling of materials and equipment may augment the space requirement.
sv: Hantering av material och utrustning kan öka utrymmesbehovet.

source: So too can other factors, e.g. the need for footholds, clothing, dirt and grime on walls etc.
sv: Det kan också behöva ökas beroende på andra faktorer som t.ex. fotfäste, klädsel, smuts och föroreningar på väggarna etc.

source: Suitable communications are a prerequisite of rational, safe work.
sv: Lämpliga samband är en viktig förutsättning för rationellt och säkert arbete.

source: Accessibility and communications are decided by the positioning, design and configuration of the premises and by their relative positioning and connections.
sv: Tillgänglighet och samband bestäms av lokalernas förläggning, utformning och disposition samt deras inbördes placering och förbindelser.

source: If frequent movements and transports are foreseeable between different premises, those premises should be grouped together and provided with a direct link.
sv: Om täta förflyttningar och transporter kan förutses mellan olika lokaler bör lokalerna samlas och ges invändig förbindelse.

source: It is important that personnel facilities, and especially rest rooms and toilets, should be within close reach of work premises.
sv: Det är viktigt att det från arbetslokaler finns nära tillgång till personalrum, särskilt till pausrum och toaletter.

source: This is very much the case where younger school children are concerned.
sv: Detta gäller i hög grad för yngre skolbarn.

source: A school playground in a neighbouring park does not usually measure up to the requirement of this section.
sv: En ”skolgård” i en park i omgivningen eller toaletter i ett särskilt hus längst bort på skolgården motsvarar oftast inte kravet i paragrafen.

source: It is important that traffic routes should be planned so as to be safe for pedestrians and vehicles and so that employees working near them will not be exposed to accident risks by the traffic.
sv: Det är viktigt att förbindelseleder planeras så att de är säkra för gående och fordon och så att arbetstagare som arbetar i närheten av dessa förbindelseleder inte utsätts för olycksrisker genom trafiken.

source: Problems concerning movement and transport outdoors can occur, for example, at motels.
sv: Problem med förflyttning och transporter utomhus kan förekomma vid t.ex. motell.

source: A wind-proof canopy roof of sufficient width and with the ground levelled for cleaning and laundry trolleys usually suffices in this context as a climate-protected link between the guest rooms in the same building.
sv: Ett vindskyddat skärmtak med tillräcklig bredd och med underlaget planerat för städ- och tvättvagnar är därvid vanligtvis tillräckligt som klimatskyddad förbindelse mellan gästrummen i samma byggnad.

source: A satisfactory access route to a service installation room is safe and convenient and permits the transport of such tools and materials as are used.
sv: En tillfredsställande tillträdesled till driftrum är säker och bekväm och medger transport av förekommande verktyg och material.

source: An access route normally needs to be permanent.
sv: behöver normalt vara permanent.

source: For ascent there should normally be a staircase with handrails.
sv: För uppstigning bör normalt finnas trappa med ledstänger.

source: Access routes and doors of fan rooms should be of full height.
sv: Tillträdesleder och dörrar till fläktrum bör ha full höjd.

source: Access routes to spaces for installations, and especially lift machine rooms, are also dealt with in the Building Regulations of the National Board of Housing, Building and Planning (BBR) and in the same authority’s Lift Provisions (H).
sv: Tillträdesväg till utrymmen för installationer, särskilt hissmaskinrum, behandlas även i Boverkets byggregler (BBR) och Boverkets hissföreskrifter (H).

source: The tasks must also be possible to carry out by the employee in question.
sv: Arbetsuppgifterna måste dessutom kunna utföras av denne arbetstagare.

source: A departure from the requirement for accessibility and usability may thus come into question for a certain room, part of a room or individual workplace, where justified by the nature of the work
sv: Avsteg från kravet på tillgänglighet och användbarhet kan alltså bli aktuellt för en viss lokal, del av lokal eller enskild arbetsplats där det är befogat med hänsyn till arbetets art.

source: When work premises are made accessible to persons with functional impairment, it is important that personnel facilities, e.g. a canteen, toilet, wardrobe space and wash basin, should also be accessible to them.
sv: När arbetslokaler görs tillgängliga för personer med funktionsnedsättning är det viktigt att även personalutrymmen är tillgängliga och användbara, t.ex. matutrymme, toalettrum, kläd- och tvättutrymme.

source: During the project planning phase, the limitation means that only workplaces where it can be foreseen that there will be employees with various types of functional impairment must be designed for general accessibility and usability.
sv: I projekteringsskedet innebär begränsningen att endast arbetsställen, där man kan förutse att det i framtiden kommer att finnas anställda med olika typer av funktionsnedsättning, måste utformas för en allmän/generell tillgänglighet och användbarhet.

source: Accessibility for persons with impaired mobility can usually be considered to have been provided if the room is accessible to a person in a wheelchair.
sv: Tillgänglighet för personer med nedsatt rörelseförmåga kan normalt anses tillgodosedd om lokalen är tillgänglig för en person med rullstol.

source: Special attention needs to be paid here to obstructive differences in height, but also to the provision of adequate clearance in doorways and passages and to the possibility of opening doors from a wheelchair.
sv: Därvid behöver särskilt beaktas hindrande höjdskillnader men också tillräckligt fritt mått i dörrar och passager samt möjlighet att öppna dörrar från rullstol.

source: Even small differences in height – thresholds, for example – may constitute obstacles.
sv: Även små höjdskillnader t.ex. trösklar kan vara hinder.

source: Measures for making a room accessible to persons with impaired vision include paying special attention to the risks presented by obstacles and differences in level, e.g. by marking steps, by providing simple and clear communications between rooms to facilitate orientation, by choosing suitable flooring and contrasting colours, and by providing sufficient, dazzle- free lighting.
sv: Exempel på åtgärder för att göra en lokal tillgänglig för personer med nedsatt syn är att risker från hinder och nivåskillnader särskilt beaktas, t.ex. genom markering av trappsteg, att orienteringen underlättas genom enkla och tydliga samband mellan lokaler, val av lämpligt golvmaterial och kontrasterande färgsättning samt att tillräcklig och bländfri belysning finns.
